<?php 




$screens = array();


                   $u=rand(12,90);
                  $C1=rand(12,50);
                  $P=($u * $C1);
                  $C2=rand(2,20);
                  $P2=($C2 * 12 * $u);
                   $C3=($C2 * 12);



	/*************************************************/
	/************** screen start *****************/







	/*********** Question ************/
	$Ascreen = array();
	$Ascreen["META"]["TYPE"] = "Question"; 

	$Ascreen["DATA"][] = " Q.2  यदि $C1 नारियलों का मूल्य $P रूपए हो तो $C2 दर्जन नारियलों का मूल्य लगभग कितने रूपए होगा? ";
	$Ascreen["DATA"][] = " ";
	$screens[] = $Ascreen;

	/************** screen stop *****************/
	/*************************************************/








	/*************************************************/
	/************** screen start *****************/
	$Ascreen = array();

	$Ascreen["META"]["TYPE"] = "Process"; 

                     $Ascreen["DATA"][] = "1 दर्जन नारियल=12 नारियल";
                     $Ascreen["DATA"][] = "$C2 दर्जन नारियल=(12x$C2) =$C3 नारियल ";

	$Ascreen["DATA"][] = "$C1 नारियलों का मूल्य =$P रूपए ";
	$Ascreen["DATA"][] = "1 नारियल का मूल्य =($P/$C1)रूपए ";

                    $Ascreen["DATA"][] = " $C3 नारियल का मूल्य =($P/$C1)$C3 = $P2 रूपए  ";
                     $screens[] = $Ascreen;

	/************** screen stop *****************/
	/*************************************************/


                   /*************************************************/
	/************** screen start *****************/
	$Ascreen = array();

	$Ascreen["META"]["TYPE"] = "Process"; 

                     $Ascreen["DATA"][] = "1 दर्जन नारियल=12 नारियल";
                     $Ascreen["DATA"][] = "C<sub>2</sub> दर्जन नारियल=(12xC<sub>2</sub>) ";
                    $Ascreen["DATA"][] = " =C<sub>3</sub>नारियल";

	$Ascreen["DATA"][] = "C<sub>1</sub>नारियलों का मूल्य =P रूपए ";
	$Ascreen["DATA"][] = "1 नारियल का मूल्य =(P/C<sub>1</sub>)रूपए  ";
                     $Ascreen["DATA"][] = "C<sub>3</sub>नारियल का मूल्य =(P/C<sub>1</sub>)C<sub>3</sub> रूपए  ";
                    
                    $screens[] = $Ascreen;

	/************** screen stop *****************/
	/*************************************************/

                    /*************************************************/
	/************** screen start *****************/
	$Ascreen = array();

	$Ascreen["META"]["TYPE"] = "Process"; 
	$Ascreen["DATA"][] = "C<sub>3</sub>नारियल का मूल्य =(P/C<sub>1</sub>)C<sub>3</sub> रूपए";
	$Ascreen["DATA"][] = "$C3 नारियल का मूल्य =($P/$C1)$C3 = $P2 रूपए    ";
                     $Ascreen["DATA"][] = "";
                     $screens[] = $Ascreen;

	/************** screen stop *****************/
	/*************************************************/




?>