<?php 




$screens = array();


                   $u=rand(12,90); // unit price
                  $C1=rand(12,50); // count of items
                  $P=($u * $C1); // total price 

                  $C2=rand(2,20);
                  $P2=($C2 * 12 * $u);
                   $C3=($C2 * 12);



	/*************************************************/
	/************** screen start *****************/




  






	/*********** Question ************/
	$Ascreen = array();
	$Ascreen["META"]["TYPE"] = "Question"; 

	$Ascreen["DATA"][] = "यदि 1 नारियल का मूल्य $u रूपए हो तो $C1 नारियल का मूल्य लगभग कितने रूपए होगा? ";
	$Ascreen["DATA"][] = " ";
	$screens[] = $Ascreen;

	/************** screen stop *****************/
	/*************************************************/













	/*************************************************/
	/************** screen start *****************/
	$Ascreen = array();

	$Ascreen["META"]["TYPE"] = "Process"; 
	$Ascreen["DATA"][] = "1 नारियल का मूल्य = $u रूपए ";
	$Ascreen["DATA"][] = "$C1 नारियल का मूल्य = $u + $u+ $u ... ($C1 बार ) रूपए = $u x $C1 = $P रूपए ";
                     $screens[] = $Ascreen;

	/************** screen stop *****************/
	/*************************************************/




?>